/*
	{F81414} - червоний
	{FFFFFF} -  білий, -1
	{FFFF00} - жовтий
*/

public OnPlayerDeath(playerid, killerid, reason) //В калбек який викликається після смерті персонажа
{
	if(killerid != INVALID_PLAYER_ID) //перевірка щоб не спрацьовувало якщо гравець вбив сам себе.
	{
		killinfo(playerid, killerid); //для зручності та оптимальності створив сток, викликаємо його.
	}
    return 1;
}
stock killinfo(playerid, killerid) //сам сток, аргументи: playerid - жертва, killerid - вбивця
{
    new year, month, day, hour, minuite; //створюємо відмінні для зберігання дати та часу
    getdate(year, month, day); //дізнаємось дату та записуємо в змінні
    gettime(hour, minuite); //дізнаємось час та записуємо

    new nick[MAX_PLAYER_NAME +1], weapon = GetPlayerWeapon(killerid); //перевіряємо яка зброя в руках в killerid та зберігаємо ID в змінну. (можна і напряму, але для зручності створюю)
    GetPlayerName(killerid, nick, sizeof(nick));
    
	new weapon_name[][] = {
    "Кулаків", // 0
    "Кастета", // 1
    "Клюшки для гольфа", // 2
    "Поліцейської дубинки", // 3
    "Ножа", // 4
    "Бейсбольної бити", // 5
    "Лопати", // 6
    "Більярдного кия", // 7
    "Катани", // 8
    "Бензопили", // 9
    "Великого дилдо", // 10
    "Малого дилдо", // 11
    "Великого вібратора", // 12
    "Малого вібратора", // 13
    "Квітів", // 14
    "Тростя", // 15
    "Гранати", // 16
    "Сльозоточивого газу", // 17
    "Коктеля молотова", // 18
    "", "", "", // 19-21 (пропуск інших ID, які не використовуються)
    "Кольта.45", // 22
    "Кольта.45 з глушителем", // 23
    "Desert Eagle", // 24
    "Дробовика", // 25
    "Обріза", // 26
    "Дробовика SPAS-12", // 27
    "Микро-Узи", // 28
    "MP5", // 29
    "АК-47", // 30
    "M4", // 31
    "TEC-9", // 32
    "Гвинтівки", // 33
    "Снайперської гвинтівки", // 34
    "Гранатомета", // 35
    "Самонаводящого гранатомета", // 36
    "Вогнемета", // 37
    "Мінігана", // 38
    "Взривчатки", // 39
    "Детонатора", // 40
    "Балончика з краскою", // 41
    "Вогнетушителя" // 42
};
	new string[62+(MAX_PLAYER_NAME-6 +3 +27)+1]; //створюємо відмінні для зберігання текста, для мінімального споживання памяті підрахував макс.розмір символів
    format(string, sizeof(string), "Ви були вбиті гравцем {F81414}%s[%d]. {FFFFFF}За допомогою: %s", nick, killerid, weapon_name[weapon]); //форматуємо сам текст
    SendClientMessage(playerid, -1, string); //Відправляємо текст в чат playerid
		
    format(string, sizeof(string), "Час смерті {FFFF00}%02d:%02d | {FFFFFF}Дата: {FFFF00}%02d.%02d.%d", hour, minuite, day, month, year);
    SendClientMessage(playerid, -1, string);
    return 1;
}
